# 苯甲酸质量，需改！
m1 = 0.9652
# 输入水当量最低温，需改！
b =22.1181
# 输入水当量最高温，需改！
a =23.8911
# 苯甲酸燃烧中引燃丝损失长度，需改！
d1 = 9
# 萘质量，需改！
M = 0.7611
# 输入萘燃烧最低温，需改！
e =23.75528774
# 输入萘燃烧最高温，需改！
f =25.873555
# 请输入萘燃烧中引燃丝损失长度，需改！
d2 = 9.3
# **************************************以下请勿改动！****************************************
# 苯甲酸燃烧热
c = -26460
# 燃烧丝燃烧热
p = -15.42
# 计算水当量
k=((m1*c+p*d1))/(a-b)
print('水当量为：{}J/℃'.format(k))
# 引燃丝损失长度
Q1=(k*f-k*e-p*d2)/(M/128.174)
Q2=(k*f-k*e-p*d2)/M
Q3=Q2*0.001
Q4=Q1-2*8.314*((f+e)/2+273.15)
print("萘的恒容燃烧热为:{}J/mol,{}kJ/g,恒压燃烧热为{}J/mol".format(Q1,Q3,Q4))
z=40.19*128.174
print('萘燃烧热参考值：40.19kJ/g',z)